Revit 2027 API
RebarShapeTerminationsData.EndTreatmentTypeIdAtStart Property
 Identifies the end treatment type at the start of the rebar shape. Setting this property to a valid value, will set the HookAngleAtStart to 0 and HasCrankAtStart to false.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId EndTreatmentTypeIdAtStart { get; set; }
Public Property EndTreatmentTypeIdAtStart As ElementId
	Get
	Set
public:
property ElementId^ EndTreatmentTypeIdAtStart {
	ElementId^ get ();
	void set (ElementId^ value);
}
member EndTreatmentTypeIdAtStart : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: endTreatmentTypeIdAtStart doesn't represent an end treatment type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarShapeTerminationsData Class
Autodesk.Revit.DB.Structure Namespace